[
  {
    "title": "Hypertrophy",
    "subtitle": "Plan Your Path to Fitness Success.",
    "paragraphs": [
      "With the Hypertrophy app you can effectively plan and structure your workouts into mesocycles. A mesocycle is a structured period of training typically lasting several weeks to a few months, focusing on specific aspects of fitness or performance.",
      "Daily you are presented with the workout you need to perform based on your mesocycle's schedule. This eliminates guesswork, ensuring you follow your planned regimen. Every completed workout is stored, which allows for a clear overview of your training and tracking progress.",
      "This fullstack app is built with Next.js, TypeScript, Tailwind, and uses MongoDB for storing data, Shadcn UI library, and Clerk for OAuth authentication."
    ],
    "urls": {
      "netlify": "https://hypertrophy-self.vercel.app/",
      "github": "https://github.com/aljaz-ferenc/hypertrophy"
    },
    "id": 0,
    "image": "hypertrophy"
  },
  {
    "title": "Vista Chat",
    "subtitle": "Your chat, your way.",
    "paragraphs": [
      "Vista Chat enables user-to-user messaging and effortless sharing of images and files.",
      "FRONTEND - On the frontend, the app is made using React.js, prioritizing a smooth and intuitive user interface for a hassle-free chatting experience.",
      "BACKEND - The backend is powered by Express, incorporating a CRUD API for user account management and authentication via Json Web Tokens. MongoDB serves as the database, while real-time communication is facilitated by socket.io.",
      "NOTE - Please allow 30 seconds for the server to start, if the page doesn't load or login immediately."
    ],
    "urls": {
      "netlify": "https://vista-chat-af.netlify.app/login",
      "github": "https://github.com/aljaz-ferenc/vista-chat/tree/master"
    },
    "id": 1,
    "image": "vista-chat"
  },
  {
    "title": "Travelology",
    "subtitle": "Your personal travel journal.",
    "paragraphs": [
      "Travelology is a companion app for travel enthusiasts, which allows them to save new trips with detailed descriptions and pinpoint their favorite places on a map.",
      "FRONTEND - The app was built with React.js and React Leaflet on the frontend, providing an interactive user interface.",
      "BACKEND - Powered by Express.js and MongoDB and implements essential CRUD functionalities and user authentication using Json Web Tokens and cookies."
    ],
    "urls": {
      "netlify": "https://travelology-af.netlify.app/",
      "github": "https://github.com/aljaz-ferenc/travelology"
    },
    "id": 2,
    "image": "travelology"
  },
  {
    "title": "Sleepiest Clone",
    "subtitle": "All about animations.",
    "paragraphs": [
      "This is a clone of the sleepiest.com landing page. I chose this website for its beautiful design and animations.",
      "Animations are made with Framer Motion, mostly based on scrolling. The page uses a few different types of animations like animating elements as they come into view, staggering animations and parallax effect."
    ],
    "urls": {
      "netlify": "https://sleepiest-clone-af.netlify.app/",
      "github": "https://github.com/aljaz-ferenc/sleepiest-clone"
    },
    "id": 3,
    "image": "sleepiest"
  },
  {
    "title": "Alien Invaders",
    "subtitle": "Remember the 90s?",
    "paragraphs": [
      "For this app I decided to explore HTML canvas and making games in JavaScript and it was a very fun project to work on. Elements are constantly being tracked for collision detection. Collisions between different elements have different outcomes.",
      "The user can choose their battleship, aliens change color based on how many times they have been hit, and every now and then you'll get an upgrade drop which makes your ship shoot multiple bullets at once. The game has four levels and new levels can be added very easily."
    ],
    "urls": {
      "netlify": "https://alien-invaders-af.netlify.app/",
      "github": "https://github.com/aljaz-ferenc/alien-invaders"
    },
    "id": 4,
    "image": "alien-invaders"
  }
]
